app/views/lists/destroy.js.erb

SELECT COUNT(*) FROM `lists`
---
/* Replace the count of comments */
$("#list_count").html("<%= pluralize(List.count, 'List') %>");