app/views/lists/show.html.erb

<h2>Todolists</h2>
<% @list.todolists.each do |todolist| %>
---
SELECT `todolists`.* FROM `todolists` WHERE `todolists`.`list_id` = 1