app/views/todolists/show.html.erb


  	<% if @todolist.tags.count != 0 %>
---
SELECT `tags`.* FROM `tags` WHERE `tags`.`todolist_id` = 2 LIMIT 1