app/controllers/lists_controller.rb

  def index
    @lists = List.all
---
SELECT `lists`.* FROM `lists`

  def show
    if params[:id]
      @list = List.find(params[:id])
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1

  def edit
    @list = List.find(params[:id])
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1

  def create
    @list = List.new(params[:list])

    respond_to do |format|
      if @list.save
---
INSERT INTO `lists` (`created_at`, `name`, `ow`, `published`, `sorting`, `taskview`, `updated_at`, `uuid`) VALUES ('2011-07-11 09:06:28', 'First task', 0, 0, 0, 1, '2011-07-11 09:06:28', '')

  def update
    @list = List.find(params[:id])
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 0 LIMIT 1

  def destroy
    @list = List.find(params[:id])
    @todolist = Todolist.delete_all(["list_id = ?", params[:id]])
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 10 LIMIT 1
DELETE FROM `lists` WHERE `lists`.`id` = 10