app/controllers/todolists_controller.rb

SELECT `todolists`.* FROM `todolists`
---
  def index
    @todolists = Todolist.all

SELECT `todolists`.* FROM `todolists` WHERE `todolists`.`id` = 1 LIMIT 1
---
  def show
    @todolist = Todolist.find(params[:id])

SELECT `todolists`.* FROM `todolists` WHERE `todolists`.`id` = 1 LIMIT 1
---
  def edit
    @todolist = Todolist.find(params[:id])

SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1
INSERT INTO `todolists` (`compl`, `created_at`, `d_completed`, `duedate`, `list_id`, `note`, `ow`, `prio`, `tags`, `tags_ids`, `title`, `updated_at`, `uuid`) VALUES (0, '2011-07-11 09:42:34', NULL, '2011-07-11', 0, '', '0', 0, '', '', '', '2011-07-11 09:42:34', '')
---
  def create
     if params[:commit]
       @list = List.find(params[:list_id])
        @todolist = @list.todolists.create(params[:todolist])

SELECT `todolists`.* FROM `todolists` WHERE `todolists`.`id` = 2 LIMIT 1
UPDATE `todolists` SET `note` = '', `duedate` = '2011-07-11', `updated_at` = '2011-07-11 12:45:40' WHERE `todolists`.`id` = 2
---
  def update
    @todolist = Todolist.find(params[:id])

    respond_to do |format|
      if @todolist.update_attributes(params[:todolist])

SELECT `todolists`.* FROM `todolists` WHERE `todolists`.`id` = 1 LIMIT 1
DELETE FROM `todolists` WHERE `todolists`.`id` = 1
---
  def destroy
    @todolist = Todolist.find(params[:id])
    @todolist.destroy